#### Pandas - DataFrame And Series
Pandas is a powerful data manipulaiton library in Python, widely used for data analysis and data cleaning. It provides two primary data structures: Series and DataFrame.
- Series: A Series is a one-dimensional array-like object.
- DataFrame: DataFrame is a two-dimensional, size mutable, and potentially heterogenous tabular data structure with labeled axes(rows and columans).

In [1]:
import pandas as pd

In [3]:
## Series
## Pandas series is a one-dimensional array-like object that can hold any data type. It is similar to a column in a table.

import pandas as pd
data = [1,2,3,4,5]
series = pd.Series(data)
print("Series \n",series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [4]:
## Create a Series from dictionary 
data = {'a':1,'b':2,'c':3}
series_dict = pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [5]:
data = [10,20,30]
index = ['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [6]:
## DataFrame
## create a DataFrame from a dictionary of list

data = {
    'Name':['Cory','John','Manu'],
    'Age':[25,30,45],
    'City':['Texas','New York','Florida']
}
df = pd.DataFrame(data)
print(df)
print(type(df))

   Name  Age      City
0  Cory   25     Texas
1  John   30  New York
2  Manu   45   Florida
<class 'pandas.core.frame.DataFrame'>

In [7]:
import numpy as np
np.array(df)

array([['Cory', 25, 'Texas'],
       ['John', 30, 'New York'],
       ['Manu', 45, 'Florida']], dtype=object)

In [8]:
## create a DataFrame form a list of dictionaries
data =[
    {'Name':'Cory','Age':25,'City':'Texas'},
    {'Name': 'John','Age':30,'City': 'New York'},
    {'Name':'Jack','Age':45,'City':'Florida'},
     {'Name':'Manu','Age':40,'City':'WC'}
]
df = pd.DataFrame(data)
print(df)
print(type(df))

   Name  Age      City
0  Cory   25     Texas
1  John   30  New York
2  Jack   45   Florida
3  Manu   40        WC
<class 'pandas.core.frame.DataFrame'>

In [9]:
df=pd.read_csv('online-retail-dataset.csv')
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

In [10]:
df.tail()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,12/9/2011 12:50,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,12/9/2011 12:50,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,12/9/2011 12:50,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12/9/2011 12:50,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12/9/2011 12:50,4.95,12680.0,France

In [35]:
## Accessing data from DataFrame
data = {
    'Name':['Cory','John','Manu'],
    'Age':[25,30,45],
    'City':['Texas','New York','Florida']
}
df = pd.DataFrame(data)
df

   Name  Age      City
0  Cory   25     Texas
1  John   30  New York
2  Manu   45   Florida

In [14]:
print(df['Name'])
print(type(df['Name']))

0    Cory
1    John
2    Manu
Name: Name, dtype: object
<class 'pandas.core.series.Series'>

In [16]:
df.loc[0]    ##picking oth row

Name     Cory
Age        25
City    Texas
Name: 0, dtype: object

In [18]:
df.iloc[0][2]

C:\Users\sthar\AppData\Local\Temp\ipykernel_19120\2519637664.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

'Texas'

In [22]:
df

   Name  Age      City
0  Cory   25     Texas
1  John   30  New York
2  Manu   45   Florida

In [24]:
## Accessing a specified element
print(df.at[2,'Name'])

Manu

In [25]:
## Accessing a specified element using iat
df.iat[2,2]

'Florida'

In [26]:
df

   Name  Age      City
0  Cory   25     Texas
1  John   30  New York
2  Manu   45   Florida

In [27]:
## Data manipulation with DataFrame
df

   Name  Age      City
0  Cory   25     Texas
1  John   30  New York
2  Manu   45   Florida

In [36]:
## Add new column 'Salary'
df['Salary']=[50000,60000,70000]

In [37]:
df

   Name  Age      City  Salary
0  Cory   25     Texas   50000
1  John   30  New York   60000
2  Manu   45   Florida   70000

In [38]:
## Remove a column
df.drop('Salary',axis=1)

   Name  Age      City
0  Cory   25     Texas
1  John   30  New York
2  Manu   45   Florida

In [39]:
df

   Name  Age      City  Salary
0  Cory   25     Texas   50000
1  John   30  New York   60000
2  Manu   45   Florida   70000

In [40]:
# here drop is temporary operation till now, to make it permenent operation just add paramter inplace=True
df.drop('Salary',axis=1,inplace=True)
df

   Name  Age      City
0  Cory   25     Texas
1  John   30  New York
2  Manu   45   Florida

In [41]:
## Add age to the column
df['Age']=df['Age']+1
df

   Name  Age      City
0  Cory   26     Texas
1  John   31  New York
2  Manu   46   Florida

In [42]:
# Drop according to rows
df.drop(0)

   Name  Age      City
1  John   31  New York
2  Manu   46   Florida

In [43]:
df

   Name  Age      City
0  Cory   26     Texas
1  John   31  New York
2  Manu   46   Florida

In [44]:
df.drop(0,inplace=True)
df

   Name  Age      City
1  John   31  New York
2  Manu   46   Florida

In [45]:
df=pd.read_csv('online-retail-dataset.csv')
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

In [47]:
# Display the data types of each column
print("Data types:\n",df.dtypes)

# Describe the dataframe
print("Satistical summary:\n",df.describe())

Data types:
 InvoiceNo       object
StockCode       object
Description     object
Quantity         int64
InvoiceDate     object
UnitPrice      float64
CustomerID     float64
Country         object
dtype: object
Satistical summary:
             Quantity      UnitPrice     CustomerID
count  541909.000000  541909.000000  406829.000000
mean        9.552250       4.611114   15287.690570
std       218.081158      96.759853    1713.600303
min    -80995.000000  -11062.060000   12346.000000
25%         1.000000       1.250000   13953.000000
50%         3.000000       2.080000   15152.000000
75%        10.000000       4.130000   16791.000000
max     80995.000000   38970.000000   18287.000000

In [48]:
df.describe()

            Quantity      UnitPrice     CustomerID
count  541909.000000  541909.000000  406829.000000
mean        9.552250       4.611114   15287.690570
std       218.081158      96.759853    1713.600303
min    -80995.000000  -11062.060000   12346.000000
25%         1.000000       1.250000   13953.000000
50%         3.000000       2.080000   15152.000000
75%        10.000000       4.130000   16791.000000
max     80995.000000   38970.000000   18287.000000